clear all
clc
%----------------------------------------------------------------------
%Задача 1
    disp('Задача 1:')
%----------------------------------------------------------------------
%1.1
    disp('Пункт 1:')
%Канонический вид
    disp('Канонический вид:')
    S='x^2/12+y^2/4-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-4:0.01:4;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 1),plot(x, real(y)),title('basic');
%1.2
    disp('Пункт 2:')
% Увеличим коэффциент перед x^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2+y^2/4-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-2:0.01:2;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 2),plot(x, real(y)),title('12*c*x^2'); 
% Увеличим коэффциент перед y^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2/12+y^2-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-6:0.01:6;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 3),plot(x, real(y)),title('4*c*y^2');
% Уменьшим  коэффциент перед x^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2/24+y^2/4-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-6:0.01:6;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 4),plot(x, real(y)),title('1/2*c*x^2');
% Уменьшим  коэффциент перед y^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2/12+y^2/16-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-4:0.01:4;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 5),plot(x, real(y)),title('1/4*c*y^2');
% Уменьшим  коэффциент перед x^2 и y^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2/24+y^2/16-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-10:0.01:10;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 6),plot(x, real(y)),title('1/2*c*x^2 1/4*c*y^2');
% Увеличим  коэффциент перед x^2 и y^2
%Канонический вид
    disp('Канонический вид:')
    S='x^2+y^2-1';
    disp(S)
%Выразим y
    disp('Выразим y через x:')
    Sy=solve(S,'y');
    disp(Sy)
%Теперь зададим  диапазон x и значения y.
    x=-10:0.01:10;
    y=subs(Sy,'x',x);
%Выводим график
    subplot(3, 3, 7),plot(x, real(y)),title('12*c*x^2 4*c*y^2');
%----------------------------------------------------------------------
clear all
%----------------------------------------------------------------------
%Задача 2
    disp('Задача 2:')
%----------------------------------------------------------------------
%2.1
     disp('Пункт 1:')
%Канонический вид
    disp('Канонический вид:')
    S='x^2/9+y^2/4+z^2/25-1';
    disp(S)
%Выразим z
    disp('Выразим z через x и y:')
    Sz=solve(S,'z');
    disp(Sz)
%Теперь зададим  диапазон x y и значения z.
    figure; ezsurf(Sz(1)),hold on,ezsurf(Sz(2)),axis auto,hold off,title('original'); 
%----------------------------------------------------------------------
%Канонический вид
    disp('Канонический вид:')
    S='x^2/9+y^2/4+z^2-1';
    disp(S)
%Выразим z
    disp('Выразим z через x и y:')
    Sz=solve(S,'z');
    disp(Sz)
%Теперь зададим  диапазон x y и значения z.
    figure; subplot(2, 2, 1),ezsurf(Sz(1)),hold on,ezsurf(Sz(2)),axis auto,hold off,title('25*z');
%----------------------------------------------------------------------
%Канонический вид
    disp('Канонический вид:')
    S='x^2/9+y^2+z^2/25-1';
    disp(S)
%Выразим z
    disp('Выразим z через x и y:')
    Sz=solve(S,'z');
    disp(Sz)
%Теперь зададим  диапазон x y и значения z.
    subplot(2, 2, 2), ezsurf(Sz(1)),hold on,ezsurf(Sz(2)),axis auto,hold off,title('4*y'); 
%----------------------------------------------------------------------
%Канонический вид
    disp('Канонический вид:')
    S='x^2+y^2/4+z^2/25-1';
    disp(S)
%Выразим z
    disp('Выразим z через x и y:')
    Sz=solve(S,'z');
    disp(Sz)
%Теперь зададим  диапазон x y и значения z.
subplot(2, 2, 3),ezsurf(Sz(1)),hold on,ezsurf(Sz(2)),axis auto,title('9*x');
%----------------------------------------------------------------------

%Задача 3
    disp('Задача 3:')
%----------------------------------------------------------------------
%2.1
     disp('Пункт 1:')
%Канонический вид
    disp('Канонический вид:')
    S='x^2/9+y^2/4+z^2/25-1';
    disp(S)
%Теперь зададим  диапазон x y и значения z.
[X,Y,Z]=meshgrid(-4:0.1:4,-2:0.1:2,-5:0.1:5);
V=X.^2/9+Y.^2/4+Z.^2/25-1;
figure;slice(X,Y,Z,V,0,0,0);
%----------------------------------------------------------------------
